#ifndef 	_eeprom_h_
#define 	_eeprom_h_

sbit sda=P3^5;
sbit scl=P3^6;
sbit wp =P3^7;
/********************************************************************
* 名称 : x24c02_init()
* 功能 : 24c02初始化子程序
* 输入 : 无
* 输出 : 无
***********************************************************************/
extern void eeprom_init(void);
/********************************************************************
* 名称 : x24c02_read()
* 功能 : 从24c02中读出值
* 输入 : address(要在这个地址读取值）
* 输出 : 从24c02中读出的值
***********************************************************************/
extern unsigned char eeprom_read(unsigned char address);
/********************************************************************
* 名称 : x24c02_write()
* 功能 : 想24c02中写入数据
* 输入 : address(地址） ， info（值）
* 输出 : 无
***********************************************************************/
extern void eeprom_write(unsigned char address, unsigned char info);

void upload(void);
void download(void);
#endif

